In [1]:
import pandas as pd
#Creating student dataframe by reading csv file
df=pd.read_csv('Marks.csv')
print(df.head())

   student_id                Name  Math  Science  English  Total       Grade
0           1    Izabel Geraldini     6       66        0     76       array
1           2      Carri Gilcrist    67      100       58     83     Focused
2           3       Osmund Staite    66       67       22     57  neural-net
3           4  Mireielle Ghelardi    92       78       12     48        24/7
4           5    Antonella Markel    37       67       80     61  systematic

In [4]:
df.isna()

    student_id   Name   Math  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False
99       False  False  False    False    False  False  False

[100 rows x 7 columns]

In [5]:
df['Total']=df[['Math','Science','English']].sum(axis=1)
df[['Name','Math','Science','English','Total']].head()

                 Name  Math  Science  English  Total
0    Izabel Geraldini     6       66        0     72
1      Carri Gilcrist    67      100       58    225
2       Osmund Staite    66       67       22    155
3  Mireielle Ghelardi    92       78       12    182
4    Antonella Markel    37       67       80    184

In [16]:
def assign_grade(total):
    if total>=250:
        return 'A'
    elif total >= 200:
        return 'B'
    elif total>=150:
        return 'C'
    else:
        return 'D'

In [17]:
df[['Name','Total','Grade']].tail()

                 Name  Total              Grade
95  Karrie Hartwright    120         Horizontal
96     Floyd Tofanini    125            Organic
97     Antin Roswarne    232     data-warehouse
98         Chen Glewe    133  open architecture
99       Corey Comino    164           protocol

In [18]:
df['Grade']=df['Total'].apply(assign_grade)

In [19]:
grade_a_student=df[df['Grade']=='A']
print(len(grade_a_student))

2

In [20]:
print(len(df[df['Grade']=='D']))

40

In [21]:
math_max=max(df['Math'])
print(math_max)

99

In [22]:
print(df[df['Math']==math_max])

    student_id            Name  Math  Science  English  Total Grade
38          39  Dorette Caltun    99       60       49    208     B